src/test/testtool/RaadpleegMetBurgerservicenummer/03/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:str="http://exslt.org/strings" xmlns:w="http://schemas.xmlsoap.org/wsdl/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<StUF:organisatie>test</StUF:organisatie>
			<StUF:applicatie>test_A</StUF:applicatie>
			<StUF:administratie>Test1</StUF:administratie>
			<StUF:gebruiker>Test1</StUF:gebruiker>
		</StUF:zender>
		<StUF:ontvanger>
			<StUF:organisatie>0518</StUF:organisatie>
			<StUF:applicatie>DEC_ZKN</StUF:applicatie>
			<StUF:administratie/>
			<StUF:gebruiker>Test1</StUF:gebruiker>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241014152137643</StUF:tijdstipBericht>
		<StUF:crossRefnummer>2d8e1294-7238-428f-ae2b-69ed723aa64f</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<BG:inp.bsn>999993628</BG:inp.bsn>
			<BG:sub.typering xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.a-nummer>3461805105</BG:inp.a-nummer>
			<BG:geslachtsnaam>Huijgen</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:voorletters>G.</BG:voorletters>
			<BG:voornamen>Geertje</BG:voornamen>
			<BG:aanduidingNaamgebruik>V</BG:aanduidingNaamgebruik>
			<BG:geslachtsnaamPartner>Kierkegaard</BG:geslachtsnaamPartner>
			<BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:aanhefAanschrijving>Geachte mevrouw Kierkegaard-Huijgen</BG:aanhefAanschrijving>
			<BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:geslachtsnaamAanschrijving/>
			<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
			<BG:geboortedatum>19010613</BG:geboortedatum>
			<BG:inp.geboorteplaats>Huisseling en Neerloon</BG:inp.geboorteplaats>
			<BG:inp.geboorteLand>6030</BG:inp.geboorteLand>
			<BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.verblijftIn StUF:entiteittype="NPSTGO" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie>0518013530058001</BG:aoa.identificatie>
				<BG:wpl.identificatie>1245</BG:wpl.identificatie>
				<BG:wpl.woonplaatsNaam>'s-Gravenhage</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen/>
				<BG:gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:aoa.postcode>2597LD</BG:aoa.postcode>
				<BG:aoa.huisnummer>58</BG:aoa.huisnummer>
				<BG:aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<BG:begindatumVerblijf>20040404</BG:begindatumVerblijf>
			</BG:verblijfsadres>
			<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.gemeenteVanInschrijving>0518</BG:inp.gemeenteVanInschrijving>
			<BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:ing.indicatieBlokkering xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			<BG:inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>